lkolbly/cmsis-svd/data/Cypress/S6E1A1.svd
<?xml version="1.0" encoding="utf-8"?>
<!-- ************************************************************************ -->
<!-- Licence Terms                                                            -->
<!-- ************************************************************************ -->
<!-- /******************************************************************************* -->
<!-- * Copyright (C) 2013 Spansion LLC. All Rights Reserved.  -->
<!-- * -->
<!-- * This software is owned and published by:  -->
<!-- * Spansion LLC, 915 DeGuigne Dr. Sunnyvale, CA  94088-3453 ("Spansion"). -->
<!-- * -->
<!-- * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND  -->
<!-- * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT. -->
<!-- * -->
<!-- * This software contains source code for use with Spansion  -->
<!-- * components. This software is licensed by Spansion to be adapted only  -->
<!-- * for use in systems utilizing Spansion components. Spansion shall not be  -->
<!-- * responsible for misuse or illegal use of this software for devices not  -->
<!-- * supported herein.  Spansion is providing this software "AS IS" and will  -->
<!-- * not be responsible for issues arising from incorrect user implementation  -->
<!-- * of the software.   -->
<!-- * -->
<!-- * SPANSION MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE, -->
<!-- * REGARDING THE SOFTWARE (INCLUDING ANY ACOOMPANYING WRITTEN MATERIALS),  -->
<!-- * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,  -->
<!-- * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED  -->
<!-- * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED  -->
<!-- * WARRANTY OF NONINFRINGEMENT.   -->
<!-- * SPANSION SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,  -->
<!-- * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT  -->
<!-- * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,  -->
<!-- * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR  -->
<!-- * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,  -->
<!-- * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,  -->
<!-- * SAVINGS OR PROFITS,  -->
<!-- * EVEN IF SPANSION HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.  -->
<!-- * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR -->
<!-- * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED  -->
<!-- * FROM, THE SOFTWARE.   -->
<!-- * -->
<!-- * This software may be replicated in part or whole for the licensed use,  -->
<!-- * with the restriction that this Disclaimer and Copyright notice must be  -->
<!-- * included with each copy of this software, whether used in part or whole,  -->
<!-- * at all times.   -->
<!-- */ -->
<!-- 2014.2.19 generated -->
<device schemaVersion="1.0" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_0.xsd">
 <name>S6E1A1</name>
 <version>1.1</version>
 <addressUnitBits>8</addressUnitBits>
 <width>32</width>
 <size>32</size>
 <access>read-write</access>
 <resetValue>0x00000000</resetValue>
 <resetMask>0x00000000</resetMask>
 <peripherals>
   <!-- ************************************************************************************** -->
   <!-- peripheral:WorkFlashMemory -->
   <!-- ************************************************************************************** -->
    <!-- PERIPHERAL "FLASHIF" -->
    <peripheral>
      <name>FLASHIF</name>
      <description>Flash Memory</description>
      <groupName>FLASHIF</groupName>
      <baseAddress>0x40000000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x4</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x24</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x28</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x100</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "BTIM0_3_FLASH" -->
      <interrupt>
        <name>BTIM0_3_FLASH</name>
        <value>31</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "FRWTR" -->
        <register>
          <name>FRWTR</name>
          <description>Flash Read Wait Register</description>
          <addressOffset>0x4</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x01</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RWT" -->
            <field>
              <name>RWT</name>
              <description>Read Wait Cycle</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FSTR" -->
        <register>
          <name>FSTR</name>
          <description>Flash Status Register</description>
          <addressOffset>0x8</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PGMS" -->
            <field>
              <name>PGMS</name>
              <description>Flash Program Status</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SERS" -->
            <field>
              <name>SERS</name>
              <description>Flash Sector Erase Status</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ESPS" -->
            <field>
              <name>ESPS</name>
              <description>Flash Erase Suspend Status</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CERS" -->
            <field>
              <name>CERS</name>
              <description>Flash Chip Erase Status</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "HNG" -->
            <field>
              <name>HNG</name>
              <description>Flash Hang Status</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RDY" -->
            <field>
              <name>RDY</name>
              <description>Flash Ready Status</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FSYNDN" -->
        <register>
          <name>FSYNDN</name>
          <description>Flash Sync Down Register</description>
          <addressOffset>0x10</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x01</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SD" -->
            <field>
              <name>SD</name>
              <description>0</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
