lkolbly/cmsis-svd/data/Cypress/S6E1A1.svd
        <!-- REGISTER "OCU_OCSE3" -->
        <register derivedFrom="OCU_OCSE1">
          <name>OCU_OCSE3</name>
          <description>OCU ch.3 Control Register E</description>
          <addressOffset>0x134</addressOffset>
        </register>
        <!-- REGISTER "OCU_OCSE4" -->
        <register derivedFrom="OCU_OCSE0">
          <name>OCU_OCSE4</name>
          <description>OCU ch.4 Control Register E</description>
          <addressOffset>0x138</addressOffset>
        </register>
        <!-- REGISTER "OCU_OCSE5" -->
        <register derivedFrom="OCU_OCSE1">
          <name>OCU_OCSE5</name>
          <description>OCU ch.5 Control Register E</description>
          <addressOffset>0x13C</addressOffset>
        </register>
        <!-- REGISTER "OCU_OCFS10" -->
        <register>
          <name>OCU_OCFS10</name>
          <description>OCU ch.1@0 Connecting FRT Select Register</description>
          <addressOffset>0x168</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FSO1" -->
            <field>
              <name>FSO1</name>
              <description>Connects FRT ch.x to OCU ch.1</description>
              <msb>7</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FSO0" -->
            <field>
              <name>FSO0</name>
              <description>Connects FRT ch.x to OCU ch.0</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "OCU_OCFS32" -->
        <register derivedFrom="OCU_OCFS10">
          <name>OCU_OCFS32</name>
          <description>OCU ch.3@2 Connecting FRT Select Register</description>
          <addressOffset>0x169</addressOffset>
        </register>
        <!-- REGISTER "OCU_OCFS54" -->
        <register derivedFrom="OCU_OCFS10">
          <name>OCU_OCFS54</name>
          <description>OCU ch.5@4 Connecting FRT Select Register</description>
          <addressOffset>0x16A</addressOffset>
        </register>
        <!-- REGISTER "WFG_WFTF10" -->
        <register>
          <name>WFG_WFTF10</name>
          <description>WFG ch1@0 Pulse Counter Value Register</description>
          <addressOffset>0x18E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "WFG_WFTA10" -->
        <register>
          <name>WFG_WFTA10</name>
          <description>WFG ch.1@0 Timer Value Register A</description>
          <addressOffset>0x190</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "WFG_WFTB10" -->
        <register>
          <name>WFG_WFTB10</name>
          <description>WFG ch.1@0 Timer Value Register B</description>
          <addressOffset>0x192</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "WFG_WFTF32" -->
        <register>
          <name>WFG_WFTF32</name>
          <description>WFG ch3@2 Pulse Counter Value Register</description>
          <addressOffset>0x196</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "WFG_WFTA32" -->
        <register>
          <name>WFG_WFTA32</name>
          <description>WFG ch.3@2 Timer Value Register A</description>
          <addressOffset>0x198</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "WFG_WFTB32" -->
        <register>
          <name>WFG_WFTB32</name>
          <description>WFG ch.3@2 Timer Value Register B</description>
          <addressOffset>0x19A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "WFG_WFTF54" -->
        <register>
          <name>WFG_WFTF54</name>
          <description>WFG ch.5@4 Timer Value Register A</description>
          <addressOffset>0x19E</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "WFG_WFTA54" -->
        <register>
          <name>WFG_WFTA54</name>
          <description>WFG ch.5@4 Timer Value Register A</description>
          <addressOffset>0x1A0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "WFG_WFTB54" -->
        <register>
          <name>WFG_WFTB54</name>
          <description>WFG ch.5@4 Timer Value Register B</description>
          <addressOffset>0x1A2</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "WFG_WFSA10" -->
        <register>
          <name>WFG_WFSA10</name>
          <description>WFG ch.10 Control Register A</description>
          <addressOffset>0x1A4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x3FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DMOD" -->
            <field>
              <name>DMOD</name>
              <description>Specifies which polarity will be used to output the non-overlap signal</description>
              <msb>13</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PGEN" -->
            <field>
              <name>PGEN</name>
              <description>Specifies how to reflect the CH_PPG signal that is input to each channel of WFG on WFG output</description>
              <msb>11</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PSEL" -->
            <field>
              <name>PSEL</name>
              <description>The PPG timer unit to be used at each channel of WFG</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "GTEN" -->
            <field>
              <name>GTEN</name>
              <description>The CH_GATE signal for each channel of WFG</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TMD" -->
            <field>
              <name>TMD</name>
              <description>WFG's operation mode</description>
              <msb>5</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DCK" -->
            <field>
              <name>DCK</name>
              <description>Clock cycle of the WFG timer</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WFG_WFSA32" -->
        <register derivedFrom="WFG_WFSA10">
          <name>WFG_WFSA32</name>
          <description>WFG ch.32 Control Register A</description>
          <addressOffset>0x1A8</addressOffset>
        </register>
