lkolbly/cmsis-svd/data/Cypress/S6E1A1.svd
        <!-- REGISTER "REVC1" -->
        <register>
          <name>REVC1</name>
          <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
          <addressOffset>0x144</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "REV23" -->
            <field>
              <name>REV23</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV22" -->
            <field>
              <name>REV22</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV21" -->
            <field>
              <name>REV21</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV20" -->
            <field>
              <name>REV20</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV19" -->
            <field>
              <name>REV19</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV18" -->
            <field>
              <name>REV18</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV17" -->
            <field>
              <name>REV17</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "REV16" -->
            <field>
              <name>REV16</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PPGC0" -->
        <register>
          <name>PPGC0</name>
          <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
          <addressOffset>0x201</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PIE" -->
            <field>
              <name>PIE</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PUF" -->
            <field>
              <name>PUF</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTM" -->
            <field>
              <name>INTM</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PCS" -->
            <field>
              <name>PCS</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <msb>4</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MD" -->
            <field>
              <name>MD</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <msb>2</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TTRG" -->
            <field>
              <name>TTRG</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PPGC1" -->
        <register>
          <name>PPGC1</name>
          <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
          <addressOffset>0x200</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xF8</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PIE" -->
            <field>
              <name>PIE</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PUF" -->
            <field>
              <name>PUF</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTM" -->
            <field>
              <name>INTM</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PCS" -->
            <field>
              <name>PCS</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <msb>4</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
