lkolbly/cmsis-svd/data/Cypress/S6E1A1.svd
        <!-- REGISTER "RT_TMR" -->
        <register>
          <name>RT_TMR</name>
          <description>Timer Register</description>
          <alternateGroup>RT</alternateGroup>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "PWC_TMCR" -->
        <register>
          <name>PWC_TMCR</name>
          <description>Timer Control Register</description>
          <alternateGroup>PWC</alternateGroup>
          <addressOffset>0xC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x77F6</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CKS" -->
            <field>
              <name>CKS</name>
              <description>Count clock selection bits</description>
              <msb>14</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EGS" -->
            <field>
              <name>EGS</name>
              <description>Measurement edge selection bits</description>
              <msb>10</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "T32" -->
            <field>
              <name>T32</name>
              <description>32-bit timer selection bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FMD" -->
            <field>
              <name>FMD</name>
              <description>Timer function selection bits</description>
              <msb>6</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MDSE" -->
            <field>
              <name>MDSE</name>
              <description>Mode selection bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CTEN" -->
            <field>
              <name>CTEN</name>
              <description>Timer enable bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PWC_TMCR2" -->
        <register>
          <name>PWC_TMCR2</name>
          <description>Timer Control Register 2</description>
          <alternateGroup>PWC</alternateGroup>
          <addressOffset>0x11</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CKS3" -->
            <field>
              <name>CKS3</name>
              <description>Count clock selection bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PWC_STC" -->
        <register>
          <name>PWC_STC</name>
          <description>Status Control Register</description>
          <alternateGroup>PWC</alternateGroup>
          <addressOffset>0x10</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xD5</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ERR" -->
            <field>
              <name>ERR</name>
              <description>Error flag bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EDIE" -->
            <field>
              <name>EDIE</name>
              <description>Measurement completion interrupt request enable bit</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OVIE" -->
            <field>
              <name>OVIE</name>
              <description>Overflow interrupt request enable bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EDIR" -->
            <field>
              <name>EDIR</name>
              <description>Measurement completion interrupt request bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "OVIR" -->
            <field>
              <name>OVIR</name>
              <description>Overflow interrupt request bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PWC_DTBF" -->
        <register>
          <name>PWC_DTBF</name>
          <description>Data Buffer Register</description>
          <alternateGroup>PWC</alternateGroup>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "BTIOSEL03" -->
    <peripheral>
      <name>BTIOSEL03</name>
      <description>Base Timer I/O Select</description>
      <groupName>BTIOSEL03</groupName>
      <baseAddress>0x40025100</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "BTSEL0123" -->
        <register>
          <name>BTSEL0123</name>
          <description>I/O Select Register</description>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFF00</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SEL23" -->
            <field>
              <name>SEL23</name>
              <description>I/O select bits for Ch.2/Ch.3</description>
              <msb>15</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEL01" -->
            <field>
              <name>SEL01</name>
              <description>I/O select bits for Ch.0/Ch.1</description>
              <msb>11</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
