lkolbly/cmsis-svd/data/Cypress/S6E1A1.svd
      </registers>
    </peripheral>
    <!-- PERIPHERAL "SBSSR" -->
    <peripheral>
      <name>SBSSR</name>
      <description>Software-based Simultaneous Startup Register</description>
      <groupName>SBSSR</groupName>
      <baseAddress>0x40025F00</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0FC</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "BTSSSR" -->
        <register>
          <name>BTSSSR</name>
          <description>Software-based Simultaneous Startup Register</description>
          <addressOffset>0xFC</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x000F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SSSR3" -->
            <field>
              <name>SSSR3</name>
              <description>Software-based simultaneous startup bit of Ch.3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR2" -->
            <field>
              <name>SSSR2</name>
              <description>Software-based simultaneous startup bit of Ch.2</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR1" -->
            <field>
              <name>SSSR1</name>
              <description>Software-based simultaneous startup bit of Ch.1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR0" -->
            <field>
              <name>SSSR0</name>
              <description>Software-based simultaneous startup bit of Ch.0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "QPRC0" -->
    <peripheral>
      <name>QPRC0</name>
      <description>Quadrature Position/Revolution Counter 0</description>
      <groupName>QPRC0</groupName>
      <baseAddress>0x40026000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x14</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x18</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x3C</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "DTIM_QDU" -->
      <interrupt>
        <name>DTIM_QDU</name>
        <value>6</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "QPCR" -->
        <register>
          <name>QPCR</name>
          <description>QPRC Position Count Register</description>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "QRCR" -->
        <register>
          <name>QRCR</name>
          <description>QPRC Revolution Count Register</description>
          <addressOffset>0x4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "QPCCR" -->
        <register>
          <name>QPCCR</name>
          <description>QPRC Position Counter Compare Register</description>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "QPRCR" -->
        <register>
          <name>QPRCR</name>
          <description>QPRC Position and Revolution Counter Compare Register</description>
          <addressOffset>0xC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "QCRH" -->
        <register>
          <name>QCRH</name>
          <description>QPRC Control Register High Byte</description>
          <addressOffset>0x19</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CGE" -->
            <field>
              <name>CGE</name>
              <description>Detection edge selection bits</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BES" -->
            <field>
              <name>BES</name>
              <description>BIN detection edge selection bits</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AES" -->
            <field>
              <name>AES</name>
              <description>AIN detection edge selection bits</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PCRM" -->
            <field>
              <name>PCRM</name>
              <description>Position counter reset mask bits</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "QCRL" -->
        <register>
          <name>QCRL</name>
          <description>QPRC Control Register Low Byte</description>
          <addressOffset>0x18</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SWAP" -->
            <field>
              <name>SWAP</name>
              <description>Swap bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RSEL" -->
            <field>
              <name>RSEL</name>
              <description>Register function selection bit</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CGSC" -->
            <field>
              <name>CGSC</name>
              <description>Count clear or gate selection bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PSTP" -->
            <field>
              <name>PSTP</name>
              <description>Position counter stop bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RCM" -->
            <field>
              <name>RCM</name>
              <description>Revolution counter mode bits</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PCM" -->
            <field>
              <name>PCM</name>
              <description>Position counter mode bits</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "QECR" -->
        <register>
          <name>QECR</name>
          <description>QPRC Extension Control Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ORNGIE" -->
            <field>
              <name>ORNGIE</name>
              <description>Outrange interrupt enable bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ORNGF" -->
            <field>
              <name>ORNGF</name>
              <description>Outrange interrupt request flag bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ORNGMD" -->
            <field>
              <name>ORNGMD</name>
              <description>Outrange mode selection bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "QICRL" -->
        <register>
          <name>QICRL</name>
          <description>Low-Order Bytes of QPRC Interrupt Control Register</description>
          <addressOffset>0x14</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ZIIF" -->
            <field>
              <name>ZIIF</name>
              <description>Zero index interrupt request flag bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OFDF" -->
            <field>
              <name>OFDF</name>
              <description>Overflow interrupt request flag bit</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UFDF" -->
            <field>
              <name>UFDF</name>
              <description>Underflow interrupt request flag bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OUZIE" -->
            <field>
              <name>OUZIE</name>
              <description>Overflow@ underflow@ or zero index interrupt enable bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "QPRCMF" -->
            <field>
              <name>QPRCMF</name>
              <description>PC and RC match interrupt request flag bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "QPRCMIE" -->
            <field>
              <name>QPRCMIE</name>
              <description>PC and RC match interrupt enable bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "QPCMF" -->
            <field>
              <name>QPCMF</name>
              <description>PC match interrupt request flag bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "QPCMIE" -->
            <field>
              <name>QPCMIE</name>
              <description>PC match interrupt enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "QICRH" -->
        <register>
          <name>QICRH</name>
          <description>High-Order Bytes of QPRC Interrupt Control Register</description>
          <addressOffset>0x15</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "QPCNRCMF" -->
            <field>
              <name>QPCNRCMF</name>
              <description>PC match and RC match interrupt request flag bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "QPCNRCMIE" -->
            <field>
              <name>QPCNRCMIE</name>
              <description>PC match and RC match interrupt enable bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DIROU" -->
            <field>
              <name>DIROU</name>
              <description>Last position counter flow direction bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "DIRPC" -->
            <field>
              <name>DIRPC</name>
              <description>Last position counter direction bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CDCF" -->
            <field>
              <name>CDCF</name>
              <description>Count inversion interrupt request flag bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CDCIE" -->
            <field>
              <name>CDCIE</name>
              <description>Count inversion interrupt enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "QMPR" -->
        <register>
          <name>QMPR</name>
          <description>QPRC Maximum Position Register</description>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "QRCRR" -->
        <register>
          <name>QRCRR</name>
          <description>Quad counter rotation count register</description>
          <addressOffset>0x3C</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
