lkolbly/cmsis-svd/data/Cypress/S6E1A1.svd
        <!-- REGISTER "WIER" -->
        <register>
          <name>WIER</name>
          <description>Deep Standby Return Enable Register</description>
          <addressOffset>0x70C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x03FB</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WCEC1E" -->
            <field>
              <name>WCEC1E</name>
              <description>HDMI-CEC/ Remote Control Reception ch.1 interrupt return enable bit</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WCEC0E" -->
            <field>
              <name>WCEC0E</name>
              <description>HDMI-CEC/ Remote Control Reception ch.0 interrupt return enable bit</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WUE5" -->
            <field>
              <name>WUE5</name>
              <description>WKUP5 pin input return enable bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WUE4" -->
            <field>
              <name>WUE4</name>
              <description>WKUP4 pin input return enable bit</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WUE3" -->
            <field>
              <name>WUE3</name>
              <description>WKUP3 pin input return enable bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WUE2" -->
            <field>
              <name>WUE2</name>
              <description>WKUP2 pin input return enable bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WUE1" -->
            <field>
              <name>WUE1</name>
              <description>WKUP1 pin input return enable bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WLVDE" -->
            <field>
              <name>WLVDE</name>
              <description>LVD interrupt return enable bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WRTCE" -->
            <field>
              <name>WRTCE</name>
              <description>RTC interrupt return enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WILVR" -->
        <register>
          <name>WILVR</name>
          <description>WKUP Pin Input Level Register</description>
          <addressOffset>0x710</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x1F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WUI5LV" -->
            <field>
              <name>WUI5LV</name>
              <description>WKUP5 pin input level select bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WUI4LV" -->
            <field>
              <name>WUI4LV</name>
              <description>WKUP4 pin input level select bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WUI3LV" -->
            <field>
              <name>WUI3LV</name>
              <description>WKUP3 pin input level select bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WUI2LV" -->
            <field>
              <name>WUI2LV</name>
              <description>WKUP2 pin input level select bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WUI1LV" -->
            <field>
              <name>WUI1LV</name>
              <description>WKUP1 pin input level select bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DSRAMR" -->
        <register>
          <name>DSRAMR</name>
          <description>Deep Standby RAM Retention Register</description>
          <addressOffset>0x714</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SRAMR" -->
            <field>
              <name>SRAMR</name>
              <description>On-chip SRAM retention control bits</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "BUR01" -->
        <register>
          <name>BUR01</name>
          <description>Backup Registers01</description>
          <addressOffset>0x800</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BUR02" -->
        <register>
          <name>BUR02</name>
          <description>Backup Registers02</description>
          <addressOffset>0x801</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BUR03" -->
        <register>
          <name>BUR03</name>
          <description>Backup Registers03</description>
          <addressOffset>0x802</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BUR04" -->
        <register>
          <name>BUR04</name>
          <description>Backup Registers04</description>
          <addressOffset>0x803</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BUR05" -->
        <register>
          <name>BUR05</name>
          <description>Backup Registers05</description>
          <addressOffset>0x804</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BUR06" -->
        <register>
          <name>BUR06</name>
          <description>Backup Registers06</description>
          <addressOffset>0x805</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
