lkolbly/cmsis-svd/data/Cypress/S6E1A1.svd
        <!-- REGISTER "CSIO_TDR" -->
        <register>
          <name>CSIO_TDR</name>
          <description>Transmit Data Register</description>
          <alternateGroup>CSIO</alternateGroup>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "CSIO_BGR" -->
        <register>
          <name>CSIO_BGR</name>
          <description>Baud Rate Generator Registers</description>
          <alternateGroup>CSIO</alternateGroup>
          <addressOffset>0xC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x7FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BGR1" -->
            <field>
              <name>BGR1</name>
              <description>Baud Rate Generator Register 1</description>
              <msb>14</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BGR0" -->
            <field>
              <name>BGR0</name>
              <description>Baud Rate Generator Register 0</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CSIO_SCSTR0" -->
        <register>
          <name>CSIO_SCSTR0</name>
          <description>Serial Chip Select Timing Register 0</description>
          <alternateGroup>CSIO</alternateGroup>
          <addressOffset>0x1C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CSHD" -->
            <field>
              <name>CSHD</name>
              <description>Serial Chip Select Hold Delay bits</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CSIO_SCSTR1" -->
        <register>
          <name>CSIO_SCSTR1</name>
          <description>Serial Chip Select Timing Register 1</description>
          <alternateGroup>CSIO</alternateGroup>
          <addressOffset>0x1D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CSSU" -->
            <field>
              <name>CSSU</name>
              <description>Serial Chip Select Setup Delay bits</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CSIO_SCSTR32" -->
        <register>
          <name>CSIO_SCSTR32</name>
          <description>Serial Chip Select Timing Register 32</description>
          <alternateGroup>CSIO</alternateGroup>
          <addressOffset>0x20</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CSDS" -->
            <field>
              <name>CSDS</name>
              <description>Serial Chip Deselect bits</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CSIO_SACSR" -->
        <register>
          <name>CSIO_SACSR</name>
          <description>Serial Support Control Register</description>
          <alternateGroup>CSIO</alternateGroup>
          <addressOffset>0x24</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x39DF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TBEEN" -->
            <field>
              <name>TBEEN</name>
              <description>Transfer Byte Error Enable bit</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CSEIE" -->
            <field>
              <name>CSEIE</name>
              <description>Chip Select Error Interupt Enable bit</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CSE" -->
            <field>
              <name>CSE</name>
              <description>Chip Select Error Flag</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TINT" -->
            <field>
              <name>TINT</name>
              <description>Timer Interrupt Flag</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TINTE" -->
            <field>
              <name>TINTE</name>
              <description>Timer Interrupt Enable bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSYNE" -->
            <field>
              <name>TSYNE</name>
              <description>Synchronous Transmission Enable bit</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TDIV" -->
            <field>
              <name>TDIV</name>
              <description>Timer Operation Clock Division bit</description>
              <msb>4</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TMRE" -->
            <field>
              <name>TMRE</name>
              <description>Serial Timer Enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CSIO_STMR" -->
        <register>
          <name>CSIO_STMR</name>
          <description>Serial Timer Register</description>
          <alternateGroup>CSIO</alternateGroup>
          <addressOffset>0x28</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TM" -->
            <field>
              <name>TM</name>
              <description>Timer Data bits</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
