lkolbly/cmsis-svd/data/Cypress/S6E1A1.svd
        <!-- REGISTER "CSIO_STMCR" -->
        <register>
          <name>CSIO_STMCR</name>
          <description>Serial Timer Comparison Register</description>
          <alternateGroup>CSIO</alternateGroup>
          <addressOffset>0x2C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TC" -->
            <field>
              <name>TC</name>
              <description>Compare bits</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CSIO_SCSCR" -->
        <register>
          <name>CSIO_SCSCR</name>
          <description>Serial Chip Select Control Status Register</description>
          <alternateGroup>CSIO</alternateGroup>
          <addressOffset>0x30</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0020</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SST" -->
            <field>
              <name>SST</name>
              <description>Serial Chip Select Active Start bit</description>
              <msb>15</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SED" -->
            <field>
              <name>SED</name>
              <description>Serial Chip Select Active End bit</description>
              <msb>13</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCD" -->
            <field>
              <name>SCD</name>
              <description>Serial Chip Select Active Display bit</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCAM" -->
            <field>
              <name>SCAM</name>
              <description>Serial Chip Select Active Hold bit</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CDIV" -->
            <field>
              <name>CDIV</name>
              <description>Serial Chip Select Timing Operation Clock Division bit</description>
              <msb>8</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CSLVL" -->
            <field>
              <name>CSLVL</name>
              <description>Serial Chip Select Level Setting bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CSEN3" -->
            <field>
              <name>CSEN3</name>
              <description>Serial Chip Select Enable bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CSEN2" -->
            <field>
              <name>CSEN2</name>
              <description>Serial Chip Select Enable bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CSEN1" -->
            <field>
              <name>CSEN1</name>
              <description>Serial Chip Select Enable bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CSEN0" -->
            <field>
              <name>CSEN0</name>
              <description>Serial Chip Select Enable bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CSOE" -->
            <field>
              <name>CSOE</name>
              <description>Serial Chip Select Output Enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CSIO_FCR1" -->
        <register>
          <name>CSIO_FCR1</name>
          <description>FIFO Control Register 1</description>
          <alternateGroup>CSIO</alternateGroup>
          <addressOffset>0x15</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x04</resetValue>
          <resetMask>0x1F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FLSTE" -->
            <field>
              <name>FLSTE</name>
              <description>Re-transmit data lost detect enable bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FRIIE" -->
            <field>
              <name>FRIIE</name>
              <description>Received FIFO idle detection enable bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FDRQ" -->
            <field>
              <name>FDRQ</name>
              <description>Transmit FIFO data request bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FTIE" -->
            <field>
              <name>FTIE</name>
              <description>Transmit FIFO interrupt enable bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FSEL" -->
            <field>
              <name>FSEL</name>
              <description>FIFO select bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CSIO_FCR0" -->
        <register>
          <name>CSIO_FCR0</name>
          <description>FIFO Control Register 0</description>
          <alternateGroup>CSIO</alternateGroup>
          <addressOffset>0x14</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x7F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FLST" -->
            <field>
              <name>FLST</name>
              <description>FIFO re-transmit data lost flag bit</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FLD" -->
            <field>
              <name>FLD</name>
              <description>FIFO pointer reload bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FSET" -->
            <field>
              <name>FSET</name>
              <description>FIFO pointer save bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FCL2" -->
            <field>
              <name>FCL2</name>
              <description>FIFO2 reset bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FCL1" -->
            <field>
              <name>FCL1</name>
              <description>FIFO1 reset bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FE2" -->
            <field>
              <name>FE2</name>
              <description>FIFO2 operation enable bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FE1" -->
            <field>
              <name>FE1</name>
              <description>FIFO1 operation enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CSIO_FBYTE1" -->
        <register>
          <name>CSIO_FBYTE1</name>
          <description>FIFO Byte Register 1</description>
          <alternateGroup>CSIO</alternateGroup>
          <addressOffset>0x18</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "CSIO_FBYTE2" -->
        <register>
          <name>CSIO_FBYTE2</name>
          <description>FIFO Byte Register 2</description>
          <alternateGroup>CSIO</alternateGroup>
          <addressOffset>0x19</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
