lkolbly/cmsis-svd/data/Cypress/S6E1A1.svd
        <!-- REGISTER "CSIO_TBYTE0" -->
        <register>
          <name>CSIO_TBYTE0</name>
          <description>Transfer Byte Register 0</description>
          <alternateGroup>CSIO</alternateGroup>
          <addressOffset>0x3C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "CSIO_TBYTE1" -->
        <register>
          <name>CSIO_TBYTE1</name>
          <description>Transfer Byte Register 1</description>
          <alternateGroup>CSIO</alternateGroup>
          <addressOffset>0x3D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "CSIO_TBYTE2" -->
        <register>
          <name>CSIO_TBYTE2</name>
          <description>Transfer Byte Register 2</description>
          <alternateGroup>CSIO</alternateGroup>
          <addressOffset>0x40</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "CSIO_TBYTE3" -->
        <register>
          <name>CSIO_TBYTE3</name>
          <description>Transfer Byte Register 3</description>
          <alternateGroup>CSIO</alternateGroup>
          <addressOffset>0x41</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "CSIO_SCSFR0" -->
        <register>
          <name>CSIO_SCSFR0</name>
          <description>Serial Chip Select Format Register 0</description>
          <addressOffset>0x34</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x80</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CS1CSLVL" -->
            <field>
              <name>CS1CSLVL</name>
              <description>Serial Chip Select 1 Level Setting bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CS1SCINV" -->
            <field>
              <name>CS1SCINV</name>
              <description>Serial Clock Invert bit of Serial Chip Select 1</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CS1SPI" -->
            <field>
              <name>CS1SPI</name>
              <description>SPI corresponding bit of Serial Chip Select 1</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CS1BDS" -->
            <field>
              <name>CS1BDS</name>
              <description>Transfer direction select bit of Serial Chip Select 1</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CS1L" -->
            <field>
              <name>CS1L</name>
              <description>Data length select bits of Serial Chip Select 1</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CSIO_SCSFR1" -->
        <register>
          <name>CSIO_SCSFR1</name>
          <description>Serial Chip Select Format Register 1</description>
          <addressOffset>0x35</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x80</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CS2CSLVL" -->
            <field>
              <name>CS2CSLVL</name>
              <description>Serial Chip Select 2 Level Setting bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CS2SCINV" -->
            <field>
              <name>CS2SCINV</name>
              <description>Serial Clock Invert bit of Serial Chip Select 2</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CS2SPI" -->
            <field>
              <name>CS2SPI</name>
              <description>SPI corresponding bit of Serial Chip Select 2</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CS2BDS" -->
            <field>
              <name>CS2BDS</name>
              <description>Transfer direction select bit of Serial Chip Select 2</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CS2L" -->
            <field>
              <name>CS2L</name>
              <description>Data length select bits of Serial Chip Select 2</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CSIO_SCSFR3" -->
        <register>
          <name>CSIO_SCSFR3</name>
          <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
          <addressOffset>0x38</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x80</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CS3CSLVL" -->
            <field>
              <name>CS3CSLVL</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CS3SCINV" -->
            <field>
              <name>CS3SCINV</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CS3SPI" -->
            <field>
              <name>CS3SPI</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CS3BDS" -->
            <field>
              <name>CS3BDS</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CS3L" -->
            <field>
              <name>CS3L</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LIN_SCR" -->
        <register>
          <name>LIN_SCR</name>
          <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
          <alternateGroup>LIN</alternateGroup>
          <addressOffset>0x1</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UPCL" -->
            <field>
              <name>UPCL</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MS" -->
            <field>
              <name>MS</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LBR" -->
            <field>
              <name>LBR</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RIE" -->
            <field>
              <name>RIE</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE" -->
            <field>
              <name>TIE</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TBIE" -->
            <field>
              <name>TBIE</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RXE" -->
            <field>
              <name>RXE</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TXE" -->
            <field>
              <name>TXE</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LIN_SMR" -->
        <register>
          <name>LIN_SMR</name>
          <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
          <alternateGroup>LIN</alternateGroup>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xE9</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MD" -->
            <field>
              <name>MD</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <msb>7</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SBL" -->
            <field>
              <name>SBL</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SOE" -->
            <field>
              <name>SOE</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LIN_SSR" -->
        <register>
          <name>LIN_SSR</name>
          <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
          <alternateGroup>LIN</alternateGroup>
          <addressOffset>0x5</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x03</resetValue>
          <resetMask>0xBF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "REC" -->
            <field>
              <name>REC</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LBD" -->
            <field>
              <name>LBD</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FRE" -->
            <field>
              <name>FRE</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ORE" -->
            <field>
              <name>ORE</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RDRF" -->
            <field>
              <name>RDRF</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TDRE" -->
            <field>
              <name>TDRE</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TBI" -->
            <field>
              <name>TBI</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LIN_ESCR" -->
        <register>
          <name>LIN_ESCR</name>
          <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
          <alternateGroup>LIN</alternateGroup>
          <addressOffset>0x4</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x5F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ESBL" -->
            <field>
              <name>ESBL</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LBIE" -->
            <field>
              <name>LBIE</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LBL" -->
            <field>
              <name>LBL</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DEL" -->
            <field>
              <name>DEL</name>
              <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LIN_RDR" -->
        <register>
          <name>LIN_RDR</name>
          <description>ERROR!!!!!!!!!!!!!!!!!!!!</description>
          <alternateGroup>LIN</alternateGroup>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x00FF</resetMask>
        </register>
