lkolbly/cmsis-svd/data/Cypress/S6E1A1.svd
      </registers>
    </peripheral>
    <!-- PERIPHERAL "WC" -->
    <peripheral>
      <name>WC</name>
      <description>Watch Counter</description>
      <groupName>WC</groupName>
      <baseAddress>0x4003A000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x14</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "OSC_PLL_WC_RTC" -->
      <interrupt>
        <name>OSC_PLL_WC_RTC</name>
        <value>24</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "WCRD" -->
        <register>
          <name>WCRD</name>
          <description>Watch Counter Read Register</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CTR" -->
            <field>
              <name>CTR</name>
              <description>Counter read bits</description>
              <msb>5</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WCRL" -->
        <register>
          <name>WCRL</name>
          <description>Watch Counter Reload Register</description>
          <addressOffset>0x1</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RLC" -->
            <field>
              <name>RLC</name>
              <description>Counter reload value setting bits</description>
              <msb>5</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WCCR" -->
        <register>
          <name>WCCR</name>
          <description>Watch Counter Control Register</description>
          <addressOffset>0x2</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xCF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WCEN" -->
            <field>
              <name>WCEN</name>
              <description>Watch counter operation enable bit</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WCOP" -->
            <field>
              <name>WCOP</name>
              <description>Watch counter operating state flag</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CS" -->
            <field>
              <name>CS</name>
              <description>Count clock select bits</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WCIE" -->
            <field>
              <name>WCIE</name>
              <description>Interrupt request enable bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WCIF" -->
            <field>
              <name>WCIF</name>
              <description>Interrupt request flag bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CLK_SEL" -->
        <register>
          <name>CLK_SEL</name>
          <description>Clock Selection Register</description>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0703</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SEL_OUT" -->
            <field>
              <name>SEL_OUT</name>
              <description>Output clock selection bit</description>
              <msb>10</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEL_IN" -->
            <field>
              <name>SEL_IN</name>
              <description>Input clock selection bit</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CLK_EN" -->
        <register>
          <name>CLK_EN</name>
          <description>Division Clock Enable Register</description>
          <addressOffset>0x14</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CLK_EN_R" -->
            <field>
              <name>CLK_EN_R</name>
              <description>Division clock enable read bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CLK_EN" -->
            <field>
              <name>CLK_EN</name>
              <description>Division clock enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "RTC" -->
    <peripheral>
      <name>RTC</name>
      <description>REAL-TIME CLOCK</description>
      <groupName>RTC</groupName>
      <baseAddress>0x4003B000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x13</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x15</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x19</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1C</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x24</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x28</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2C</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x30</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "OSC_PLL_WC_RTC" -->
      <interrupt>
        <name>OSC_PLL_WC_RTC</name>
        <value>24</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "WTCR1" -->
        <register>
          <name>WTCR1</name>
          <description>Control Register 1</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFF1F7D</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INTCRIE" -->
            <field>
              <name>INTCRIE</name>
              <description>Year/month/date/hour/minute/second/day of the week counter value read completion interrupt enable bit</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTERIE" -->
            <field>
              <name>INTERIE</name>
              <description>Time rewrite error interrupt enable bit</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTALIE" -->
            <field>
              <name>INTALIE</name>
              <description>Alarm interrupt enable bit</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTTMIE" -->
            <field>
              <name>INTTMIE</name>
              <description>Timer interrupt enable bit</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTHIE" -->
            <field>
              <name>INTHIE</name>
              <description>1-hour interrupt enable bit</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTMIE" -->
            <field>
              <name>INTMIE</name>
              <description>1-minute interrupt enable bit</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTSIE" -->
            <field>
              <name>INTSIE</name>
              <description>1-second interrupt enable bit</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTSSIE" -->
            <field>
              <name>INTSSIE</name>
              <description>0.5-second interrupt enable bit</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTCRI" -->
            <field>
              <name>INTCRI</name>
              <description>Year/month/date/hour/minute/second/day of the week counter value read completion interrupt flag bit</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTERI" -->
            <field>
              <name>INTERI</name>
              <description>Time rewrite error interrupt flag bit</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTALI" -->
            <field>
              <name>INTALI</name>
              <description>Alarm interrupt flag bit</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTTMI" -->
            <field>
              <name>INTTMI</name>
              <description>Timer underflow flag bit</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTHI" -->
            <field>
              <name>INTHI</name>
              <description>1-hour flag bit</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTMI" -->
            <field>
              <name>INTMI</name>
              <description>1-minute flag bit</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTSI" -->
            <field>
              <name>INTSI</name>
              <description>1-second flag bit</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INTSSI" -->
            <field>
              <name>INTSSI</name>
              <description>0.5-second flag bit</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "YEN" -->
            <field>
              <name>YEN</name>
              <description>Alarm year register enable bit</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MOEN" -->
            <field>
              <name>MOEN</name>
              <description>Alarm month register enable bit</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DEN" -->
            <field>
              <name>DEN</name>
              <description>Alarm date register enable bit</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HEN" -->
            <field>
              <name>HEN</name>
              <description>Alarm hour register enable bit</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MIEN" -->
            <field>
              <name>MIEN</name>
              <description>Alarm minute register enable bit</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BUSY" -->
            <field>
              <name>BUSY</name>
              <description>Busy bit</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SCRST" -->
            <field>
              <name>SCRST</name>
              <description>Sub second generation/1-second generation counter reset bit</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SCST" -->
            <field>
              <name>SCST</name>
              <description>1-second clock output stop bit</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SRST" -->
            <field>
              <name>SRST</name>
              <description>RTC reset bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RUN" -->
            <field>
              <name>RUN</name>
              <description>RTC count block operation bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ST" -->
            <field>
              <name>ST</name>
              <description>Start bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTCR2" -->
        <register>
          <name>WTCR2</name>
          <description>Control Register 2</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000701</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TMRUN" -->
            <field>
              <name>TMRUN</name>
              <description>Timer counter operation bit</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TMEN" -->
            <field>
              <name>TMEN</name>
              <description>Timer counter control bit</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TMST" -->
            <field>
              <name>TMST</name>
              <description>Timer counter start bit</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CREAD" -->
            <field>
              <name>CREAD</name>
              <description>Year/month/date/hour/minute/second/day of the week counter value read control bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
