lkolbly/cmsis-svd/data/Cypress/S6E1A1.svd
      </registers>
    </peripheral>
    <!-- PERIPHERAL "LSCRP" -->
    <peripheral>
      <name>LSCRP</name>
      <description>Low-speed CR Prescaler Register</description>
      <groupName>LSCRP</groupName>
      <baseAddress>0x4003C000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "LCR_PRSLD" -->
        <register>
          <name>LCR_PRSLD</name>
          <description>Low-speed CR Prescaler Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LCR_PRSLD" -->
            <field>
              <name>LCR_PRSLD</name>
              <description>Low-speed CR Prescaler Load</description>
              <msb>5</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "PCG" -->
    <peripheral>
      <name>PCG</name>
      <description>Peripheral Clock Gating Registers</description>
      <groupName>PCG</groupName>
      <baseAddress>0x4003C100</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x14</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x24</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "CKEN0" -->
        <register>
          <name>CKEN0</name>
          <description>Peripheral Clock Control Register 0</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x110FFFFF</resetValue>
          <resetMask>0x110FFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "GIOCK" -->
            <field>
              <name>GIOCK</name>
              <description>Software clock control of GPIO/Fast GPIO function</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DMACK" -->
            <field>
              <name>DMACK</name>
              <description>Supplying and gating settings of DMAC operation clock</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADCCK" -->
            <field>
              <name>ADCCK</name>
              <description>Settings for operation clock supplying and gating to AD converter</description>
              <msb>19</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSCK" -->
            <field>
              <name>MFSCK</name>
              <description>Settings for operation clock supply and gating to multi-function serial interface</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MRST0" -->
        <register>
          <name>MRST0</name>
          <description>Peripheral Reset Control Register 0</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x010FFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DMARST" -->
            <field>
              <name>DMARST</name>
              <description>Reset control of DMAC</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADCRST" -->
            <field>
              <name>ADCRST</name>
              <description>Reset control of AD converter</description>
              <msb>19</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFSRST" -->
            <field>
              <name>MFSRST</name>
              <description>Control of software reset of multi-function serial interface</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CKEN1" -->
        <register>
          <name>CKEN1</name>
          <description>Peripheral Clock Control Register 1</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000F0F0F</resetValue>
          <resetMask>0x000F0F0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "QDUCK" -->
            <field>
              <name>QDUCK</name>
              <description>Settings for operation clock supply and gating of quad counter</description>
              <msb>19</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFTCK" -->
            <field>
              <name>MFTCK</name>
              <description>Settings for operation clock supply and gating of multi-function timer and PPG</description>
              <msb>11</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BTMCK" -->
            <field>
              <name>BTMCK</name>
              <description>Settings operation clock supply and gating to base timer</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MRST1" -->
        <register>
          <name>MRST1</name>
          <description>Peripheral Reset Control Register 1</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000F0F0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "QDURST" -->
            <field>
              <name>QDURST</name>
              <description>Reset control of quad counter</description>
              <msb>19</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MFTRST" -->
            <field>
              <name>MFTRST</name>
              <description>Control of multi-function timer and PPG reset control</description>
              <msb>11</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BTMRST" -->
            <field>
              <name>BTMRST</name>
              <description>Reset control of base timer</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CKEN2" -->
        <register>
          <name>CKEN2</name>
          <description>Peripheral Clock Control Register 2</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000030</resetValue>
          <resetMask>0x00000030</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CANCK" -->
            <field>
              <name>CANCK</name>
              <description>Settings for clock supply and gating to CAN controller</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MRST2" -->
        <register>
          <name>MRST2</name>
          <description>Peripheral Reset Control Reset 2</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000030</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CANRST" -->
            <field>
              <name>CANRST</name>
              <description>Reset control of CAN controller</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
